import threading
from random import randint 

# Завдання 1
# При старті додатку запускаються три потоки. Перший потік заповнює список випадковими числами. 
# Два інші потоки очікують на заповнення. Коли перелік заповнений, обидва потоки запускаються. 
# Перший потік знаходить суму елементів списку, другий потік знаходить середнє арифметичне значення у списку. 
# Отриманий список, сума та середнє арифметичне виводяться на екран. 

numbers = []

def task1(): # функция для наполнения списка случайными числами
    global numbers
    for i in range(10):
        numbers.append(randint(1, 100))
    return numbers

print(task1())
